In [2]:
import pandas as pd
df=pd.read_csv("D:\Data Science\Data Sets\Employee Array.csv")
display(df)

            Position  Level   Salary Office_Spread
0   Business Analyst       1   45000       Del,Kol
1  Junior Consultant       2   50000   Del,Kol,Mum
2  Senior Consultant       3   60000           Kol
3            Manager       4   80000       Mum,Del

In [3]:
df1=df.Office_Spread.str.split(',')
display(df1)

0         [Del, Kol]
1    [Del, Kol, Mum]
2              [Kol]
3         [Mum, Del]
Name: Office_Spread, dtype: object

In [4]:
ls=df1.tolist()
print(ls)

[['Del', 'Kol'], ['Del', 'Kol', 'Mum'], ['Kol'], ['Mum', 'Del']]

In [5]:
df2=pd.DataFrame(ls, index=(df['Position']))
display(df2)

                     0     1     2
Position
Business Analyst   Del   Kol  None
Junior Consultant  Del   Kol   Mum
Senior Consultant  Kol  None  None
Manager            Mum   Del  None

In [6]:
df3=df2.stack()
display(df3)

Position
Business Analyst   0    Del
                   1    Kol
Junior Consultant  0    Del
                   1    Kol
                   2    Mum
Senior Consultant  0    Kol
Manager            0    Mum
                   1    Del
dtype: object

In [7]:
df4=df3.reset_index()
display(df4)

            Position  level_1    0
0   Business Analyst        0  Del
1   Business Analyst        1  Kol
2  Junior Consultant        0  Del
3  Junior Consultant        1  Kol
4  Junior Consultant        2  Mum
5  Senior Consultant        0  Kol
6            Manager        0  Mum
7            Manager        1  Del

In [8]:
df5=df4.drop('level_1',axis=1)
display(df5)

            Position    0
0   Business Analyst  Del
1   Business Analyst  Kol
2  Junior Consultant  Del
3  Junior Consultant  Kol
4  Junior Consultant  Mum
5  Senior Consultant  Kol
6            Manager  Mum
7            Manager  Del

In [9]:
df6=df5.rename(columns={0:'Exploded_Offc'})
display(df6)

            Position Exploded_Offc
0   Business Analyst           Del
1   Business Analyst           Kol
2  Junior Consultant           Del
3  Junior Consultant           Kol
4  Junior Consultant           Mum
5  Senior Consultant           Kol
6            Manager           Mum
7            Manager           Del

In [10]:
#Everything in a single line

# Import pandas
import pandas as pd

# reading csv file
df=pd.read_csv("D:\Data Science\Data Sets\Employee Array.csv")
display(df)
df_out = (pd.DataFrame(df.Office_Spread.str.split(',').tolist(), index=(df['Position']))
      .stack()
      .reset_index()
      .drop('level_1',axis=1)
      .rename(columns={0:'Exploded_Offc'}))
display(df_out)

            Position  Level   Salary Office_Spread
0   Business Analyst       1   45000       Del,Kol
1  Junior Consultant       2   50000   Del,Kol,Mum
2  Senior Consultant       3   60000           Kol
3            Manager       4   80000       Mum,Del

            Position Exploded_Offc
0   Business Analyst           Del
1   Business Analyst           Kol
2  Junior Consultant           Del
3  Junior Consultant           Kol
4  Junior Consultant           Mum
5  Senior Consultant           Kol
6            Manager           Mum
7            Manager           Del

In [17]:
#Using Ravel() function to Unarray an array
import pandas as pd
import numpy as np
df=pd.read_csv("D:\Data Science\Data Sets\Employee Array.csv")
display(df)

df1=df.Office_Spread.str.split(',')


ls=list(df1)
out = np.concatenate(ls).ravel()
print(out)

            Position  Level   Salary Office_Spread
0   Business Analyst       1   45000       Del,Kol
1  Junior Consultant       2   50000   Del,Kol,Mum
2  Senior Consultant       3   60000           Kol
3            Manager       4   80000       Mum,Del

['Del' 'Kol' 'Del' 'Kol' 'Mum' 'Kol' 'Mum' 'Del']

In [18]:
#Flattening List of Lists using itertools

import itertools

regular_list = [[1, 2, 3, 4], [5, 6, 7], [8, 9, 10]]
flat_list = list(itertools.chain(*regular_list))

print('Original list', regular_list)
print('Transformed list', flat_list)

Original list [[1, 2, 3, 4], [5, 6, 7], [8, 9, 10]]
Transformed list [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [19]:
#Flattening List of Lists using Numpy

import numpy

regular_list = [[1, 2, 3, 4], [5, 6, 7], [8, 9]]

flat_list = list(numpy.concatenate(regular_list).flat)

print('Original list', regular_list)
print('Transformed list', flat_list)

Original list [[1, 2, 3, 4], [5, 6, 7], [8, 9]]
Transformed list [1, 2, 3, 4, 5, 6, 7, 8, 9]

In [20]:
#Flattening List of Lists using Sum
regular_list = [[1, 2, 3, 4], [5, 6, 7], [8, 9]]

flat_list = sum(regular_list, [])

print('Original list', regular_list)
print('Transformed list', flat_list)

Original list [[1, 2, 3, 4], [5, 6, 7], [8, 9]]
Transformed list [1, 2, 3, 4, 5, 6, 7, 8, 9]

In [21]:
#Flattening List of Lists using Lambda

irregular_list = [[1, 2, 3], [3, 6, 7], [7, 5, 4],7]

# Using lambda arguments: expression
flatten_list = lambda irregular_list:[element for item in irregular_list for element in flatten_list(item)] if type(irregular_list) is list else [irregular_list]

print("Original list ", irregular_list)
print("Transformed List ", flatten_list(irregular_list))

Original list  [[1, 2, 3], [3, 6, 7], [7, 5, 4], 7]
Transformed List  [1, 2, 3, 3, 6, 7, 7, 5, 4, 7]